

import asyncio

import os
import time
import requests
from config import START_IMG_URL
from pyrogram import filters
import random
from pyrogram import Client
from pyrogram.types import Message, InlineKeyboardMarkup, InlineKeyboardButton, ReplyKeyboardMarkup
from strings.filters import command
from AnonXMusic import (Apple, Resso, SoundCloud, Spotify, Telegram, YouTube, app)
from AnonXMusic import app
from random import  choice, randint

#▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒▇▇▒▒▇▇▇▇▇▇▒▒▇▇▇▇▇▇▇▒▒▒▒▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▇▇▒▒▒▒▒▒▒▒▒▇▇▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒▇▇▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▇▇▒▒▒▒▒▒▒▇▇▒▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▇▇▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▒▇▇▒▒▒▒▒▇▇▒▒▒▒▒▇▇▇▇▇▇▒▒▇▇▒▒▒▒▒▒▒▒▒▒▇▇▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▒▒▇▇▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▒▇▇▇▇▇▒▒▇▇▇▇▇▇▇▇▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▒▒▒▇▇▒▇▇▒▒▒▒▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▇▇▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▒▒▒▒▇▇▇▒▒▒▒▒▒▒▒▇▇▇▇▇▇▒▒▇▇▇▇▇▇▇▇▇▇▒▒▇▇▒▒▒▒▇▇▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
#▒▇▇▇▇▒▒▒▒▒▒▒▒▇▇▇▇▇▒▒▆▆▒▒▒▒▒▒▒▒▇▇▒▒▇▇▇▇▇▇▇▇▜▒▒▇▇▒▒▆▆▆▆▆▆▆▆▆
#▒▇▇▒▒▒▇▇▒▒▒▇▇▒▒▒▇▇▒▒▇▇▒▒▒▒▒▒▒▒▇▇▒▒▇▇▇▒▒▒▒▒▒▒▒▇▇▒▒▆▆▒▒▒▒▒▒▒
#▒▇▇▒▒▒▒▒▇▇▇▒▒▒▒▒▇▇▒▒▇▇▒▒▒▒▒▒▒▒▇▇▒▒▒▒▇▇▇▒▒▒▒▒▒▇▇▒▒▆▆▒▒▒▒▒▒▒
#▒▇▇▒▒▒▒▒▇▇▇▒▒▒▒▒▇▇▒▒▇▇▒▒▒▒▒▒▒▒▇▇▒▒▒▒▒▒▇▇▇▇▇▒▒▇▇▒▒▇▇▒▒▒▒▒▒▒
#▒▇▇▒▒▒▒▒▇▇▇▒▒▒▒▒▇▇▒▒▒▇▇▒▒▒▒▒▒▇▇▒▒▒▒▒▒▒▒▇▇▇▒▒▒▇▇▒▒▇▇▒▒▒▒▒▒▒
#▒▇▇▒▒▒▒▒▇▇▇▒▒▒▒▒▇▇▒▒▒▒▒▇▇▒▒▒▇▇▒▒▒▒▒▒▒▒▇▇▇▒▒▒▒▇▇▒▒▆▆▒▒▒▒▒▒▒
#▒▇▇▒▒▒▒▒▒▒▒▒▒▒▒▒▇▇▒▒▒▒▒▒▇▇▇▇▇▒▒▒▒▙▇▇▇▇▇▇▉▒▒▒▒▇▇▒▒▇▇▇▇▇▇▇▇▇
#▒▒▒▒▒░▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒
#▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒⩹━⊷⌯𝑺𝑶𝑼𝑹𝑪𝑬 𝑯𝑼𝑵𝑻𝑬𝑹 𖤐▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒



@app.on_message(
    command(["مميزات","مميزات هانتر"])
 )
async def mmmezat(client, message):
        await message.reply_text(f"""**مرحبآ بك عزيزي » {message.from_user.mention}**في قسم مميزات سورس هانتر ميوزك\n
⩹━𒍮⊷⌯⌞ ⩹━⊷⌯𝑺𝑶𝑼𝑹𝑪𝑬 𝑯𝑼𝑵𝑻𝑬𝑹 𖤐⌝⌯⊶𒍮━⩺

𒍮قايمه مميزات سورس هانتر 

𒍮ميزه ⦂ المطور بيجيب المطور البوت 
𒍮ميزه ⦂ تبيه بفتح+قفل المكالمه
𒍮ميزه ⦂ ترحيب دخول و خروج الاعضاء 
𒍮ميزه ⦂ جروب بيجيب الجروب+الرابط+ايدي
𒍮ميزه ⦂ قول البوت بيقول بالكلمه اللي بتقولها 
𒍮ميزه ⦂ الالعاب +كت+تويت+العاب متطوره
𒍮ميزه ⦂ تلغراف ميديا بردعالصوره
𒍮ميزه ⦂ ايدي بالرد بالصوره
𒍮ميزه ⦂ صورتي يرد بالصوره ونسبه
𒍮ميزه ⦂ اذاعه خاص+بالتثبيت+بالمساعد+عام
𒍮ميزه ⦂ الصوتيه..ف المكالمه
𒍮ميزه ⦂ نزول تلقائي للمساعد لعدم وجود حد فالمكالمه
𒍮ميزه ⦂ بث مباشر للقنوات 
𒍮ميزه ⦂ اسمي بيجب الاسم
𒍮ميزه ⦂ سورس بيجب السورس
𒍮ميزه ⦂ حظر+كتم ميوزك
𒍮ميزه ⦂ كشف
𒍮ميزه ⦂ منشن لكل الاعضاء
𒍮ميزه ⦂ انا من
𒍮ميزه ⦂ رتبتي
𒍮ميزه ⦂ مبرمج
𒍮ميزه ⦂ المنشئ+المالك
𒍮ميزه ⦂ الاحصائيات
𒍮ميزه ⦂ كيب المطور من خلاله تتحكم في الحساب المساعد
𒍮ميزه ⦂ الاذكار
𒍮ميزه ⦂ تبيه بوقت صلاه
𒍮ميزه ⦂ دعوه في مكالمه
𒍮ميزه ⦂  دعوه فالخاص متاع البوت
𒍮ميزه ⦂ تنبيه..بانضمام بوت في الجروبات
𒍮ميزه ⦂ غنيلي 
𒍮ميزه ⦂ بايو
𒍮ميزه ⦂ خروج المساعد من جروبات لعدم تقطيع صوت..البوت
𒍮ميزه ⦂ اسال/اصراحه
𒍮ميزه ⦂ نكت
𒍮ميزه ⦂ ذكاء اصطناعي 
𒍮ميزه ⦂ مميزات. بيجبلك مميزات موجوده فسورس 
𒍮ميزه ⦂ رفع و تنزيل مطور 
𒍮ميزه ⦂ افلام
𒍮ميزه ⦂ مكالمات النشطه+مجموعات البوت شغال فيها
𒍮ميزه ⦂ اساله دينيه
𒍮ميزه ⦂ من في المكالمه+تعرف من فالمكالمه و عددهم
𒍮ميزه ⦂ انا وين+بتجلك جروب
𒍮ميزه ⦂ الرابط+رابط مجموعه
𒍮ميزه ⦂ فنان+اكتب اسم فنان و هتجبلك اغانيه
𒍮ميزه ⦂ اصدار+حولل
𒍮ميزه ⦂ نكته
𒍮ميزه ⦂ بحث وتنزيل
𒍮ميزه ⦂ ردود بوت
𒍮ميزه ⦂ سوره+اسم السوره لتحميل سوره من القران
𒍮ميزه ⦂ كتم و حظر 
𒍮ميزه ⦂ فتح وقفل الكول (فتح؛قفل)
𒍮ميزه ⦂ حكمه
𒍮ميزه ⦂ كيب للاعضاء للاظهار ( /hunter )
𒍮ميزه ⦂ مين في الكول
𒍮ميزه ⦂ الزخرفه
⌞ ⩹━⊷⌯𝑺𝑶𝑼𝑹𝑪𝑬 𝑯𝑼𝑵𝑻𝑬𝑹 𖤐⌝⌯⊶𒍮━⩺

""",


        reply_markup=InlineKeyboardMarkup(
            [
                [
                    InlineKeyboardButton(
                        "𒍮⌞ ⩹━⊷⌯𝑺𝑶𝑼𝑹𝑪𝑬 𝑯𝑼𝑵𝑻𝑬𝑹 𖤐⌝⚡", url=f"https://t.me/huntersource"),                        
                 ],[
                InlineKeyboardButton(
                        "close", callback_data="close"),
               ],
          ]
        ),
    )

